{
  "backend/main.mo": "Motoko actor implementing access-controlled user profiles, direct messages, and group chat creation with message storage and permission checks.",
  "feature_evidence.json": "Feature evidence report mapping features to related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "List of frontend file summaries describing each component’s purpose in the app.",
  "frontend/index.css": "Tailwind base styles and OKLCH Material Design theme variables for light and dark mode.",
  "frontend/index.html": "HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app router handling authentication, profile flow, and rendering chat layout via TanStack Router.",
  "frontend/src/components/chat/AddParticipantDialog.tsx": "Dialog for adding a participant to a group chat using a Principal ID with error handling and mutation calls.",
  "frontend/src/components/chat/ConversationList.tsx": "Sidebar listing conversations with controls for refreshing, creating DMs or groups, and selecting chats.",
  "frontend/src/components/chat/CreateGroupDialog.tsx": "Dialog component for creating a new group chat, handling name input, mutation, validation, and success/error feedback.",
  "frontend/src/components/chat/NewDmDialog.tsx": "Dialog for starting a direct message by entering a Principal ID, validating it, and creating a DM conversation object.",
  "frontend/src/components/chat/ThreadView.tsx": "Displays a conversation thread for DMs or groups, fetching and sending messages, handling refresh, and supporting participant addition.",
  "frontend/src/components/material/AppShell.tsx": "Layout component providing the app bar, user profile display, logout handling, and container for main content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor using the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, stored identities, and related status flags.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, direct messages, and group chat operations using the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark Material-style color variables, base styles, and custom elevation shadows.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ChatHomePage.tsx": "Implements the main chat layout with a conversation list, thread view, and responsive mobile behavior.",
  "frontend/src/pages/LoginPage.tsx": "Renders the Internet Identity login screen with Material-style theming and a sign-in button.",
  "frontend/src/pages/RegisterPage.tsx": "Provides a user registration form to create a profile using username and display name.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters via query strings or hashes.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom Material-style colors, shadows, animations, and plugins.",
  "project_state.json": "Stores project metadata, requirements, features, and asset guidelines for the messaging app."
}